tutorials/thermoFluidSolidInteraction/flowOverHeatedPlate/system/fluid/fvSchemes1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    
}

divSchemes
{
  default none;
    // div(phi,U)   Gauss linear;
    div(phi,U) Gauss linearUpwind cellLimited leastSquares 1;
}

laplacianSchemes
{
    default none;
    laplacian(nu,U) Gauss linear corrected;
    laplacian(rAU,p) Gauss linear corrected;
    laplacian((1|A(U)),p) Gauss linear corrected;
    laplacian(diffusivity,cellMotionU) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}
fluxRequired
{
    default         no;
    p;
}


// ************************************************************************* //
